app/Controllers/Home.php

    public function index()
    {
        // Inisialisasi model SiswaModel
        $siswaModel = new SiswaModel();

        // Ambil data siswa dari model
        $data['siswa'] = $siswaModel->findAll();
---
SELECT *
FROM `siswa`

    public function saw()
    {
        // Inisialisasi model SiswaModel
        $siswaModel = new SiswaModel();

        // Ambil data siswa dari model
        $data['siswa'] = $siswaModel->findAll();
---
SELECT *
FROM `siswa`

    public function proses()
    {
        // Inisialisasi model SiswaModel dan HasilModel
        $siswaModel = new SiswaModel();
        $hasilModel = new HasilModel();

        // Ambil data siswa dari model
        $data['siswa'] = $siswaModel->findAll();
---
SELECT *
FROM `siswa`

                    }
                }
                // Simpan hasil perhitungan ke dalam tabel hasil
                $hasilModel->insert([
                    'nama' => $siswa['nama'],
                    'nilai_total' => $integral,
                ]);
---
INSERT INTO `hasil` (`nama`, `nilai_total`) VALUES ('A', 0.8625)